pico-8 cartridge // http://www.pico-8.com
version 34
__lua__
-- defy pcm channel audio player
-- by bikibird

defy_player=
{
	buffer=0x8000,
	pcm_string="",
	index=0
}
function defy_player:load(pcm_string,loop)  --load audio from pcm string and intialize
	self.pcm_string=pcm_string
	self.loop=loop or false
	self.done=false
	self.index=1
	return self
end
function defy_player:play()  --play from pcm string
	if not self.done then
		local i
		while stat(108)<1536 do
			for i=0,511 do
				poke (self.buffer+i,ord(self.pcm_string,self.index))
				self.index+=1
				if (self.index>#self.pcm_string) then
					if (self.loop) then
						self.index=1
					else
						serial(0x808,self.buffer,i+1)
						self.done=true
						return true
					end
				end
			end
			serial(0x808,self.buffer,512)
		end
	end	
end
function defy_player:play_from_serial()
	if not self.done then
		local request
		local i=0
		while stat(108)<1536 do
			if stat(120) then
				receipt = serial(0x800, self.buffer, 512)
				if #self.pcm_string < 32000 then
					for i=0,receipt-1 do
						self.pcm_string..=defy_player:to_char(@(self.buffer+i))
					end
				end	
				serial(0x808,self.buffer,receipt)	
				--if (receipt <512) self.done=true
			end
		end	
		
	end	
end
function defy_player:to_char(value)
	if (value == 0) return "\\000"
	if (value == 9) return "\\t"
	if (value == 10) return "\\n"
	if (value == 13) return "\\r"
	if (value == 92) return "\\\\"
	if (value == 34) return '\\\"'
	return chr(value)
end



_init=function()
	defy_player:load"○○██○○▒█○○▒○██○○░○○██○🐱○○○○{▒████✽○○○○🐱○████}~○○○~|▒███y○○█○○z▒█○█▒○}~█🐱○✽🐱▒wy▒~웃░✽⬇️○~⬇️○█🐱}░}█●▒▒█○~🐱~~z███▒█⬇️▒⬇️|}v|░🐱█~✽{○○n▒○█v○y⌂█z🐱~{▒}○▒x🐱░~||ww🐱웃🐱🐱░▒♥uz○○●웃░~⬆️{}}}✽█~▒○}●⬇️{⬇️{sx⬅️☉░uv}~}░▒~}z~░▒♥○}}|▒~⬇️█▒█{~🐱⌂○⬇️}|○}█⬇️⬇️}█{z🐱~🐱♪░▒█○t♥~░…⬇️🐱○○p○{●⬆️⬇️░|wt|~▒🅾️☉░|wvxy█🅾️✽☉█z{w|▒웃z▒⬇️|░▒○○▒}{⬇️}🐱🐱○🐱✽y}▒~|░{█⬅️○}}l~█⬇️🅾️░🐱sv}z◆░░{p~z🐱⬅️●█vw}{⌂▒☉wu○z♥웃z|ww○{⬅️🐱▒ws}}🅾️⬅️x▒rz{⬇️🅾️✽░qq○|⧗◆❎~lmn●░∧🅾️zsit🐱➡️お🅾️░mdt▒★▤웃zlmv●▤➡️✽wiy⬇️⬇️◆█wtw○⬅️◆░vqi⬇️♪◆➡️🐱pks●⧗⬆️⬇️soax…ˇ⧗○nin♥…⧗웃uss█웃♪░wxs{♪●☉}oqx●…⧗●womt⌂➡️…♥tiq🐱♪❎♪|tww웃🐱◆○█yxx}█★✽🐱ulx~∧🅾️○nky🅾️◆∧xxk}⬅️➡️♪zpz~⌂…○~y🐱z~z}▒⌂▒▒s}w☉🅾️♪|qqy…◆⬇️sn}♪❎웃wju░◆웃|pv⬇️…⬅️}mq█う⧗}jg|★⧗웃qjn웃◆★}ni○➡️▤♥qj|…♪●mqy★♪⌂sss☉☉…wnm▒★♪○kn~ˇ★☉nnt😐➡️😐ysr░⬅️♪●oqz⌂♪♥vtt●⌂⬅️{ys░●✽|||○░♥uv}⬅️😐░{rqx😐☉○vz~✽🐱○|⬇️█☉♥○█⬇️⬇️}z|○●🐱{yu~●█|w▒웃웃}vx~웃…~x}█●○}x🐱░⬇️✽{s░█✽{~○웃▒}z█~|✽~▒}⬇️}█w▒█♥▒|█~●🐱~s}⬇️⌂⬇️○x{⬇️{░|█~⌂█{y~~⬇️░z●|●~▒t▒░♥○}|}♥}█r○▒♪▒█w{✽🐱♥z█}웃▒~x~}░▒z~y✽~▒z▒▒🐱~○~▒░z🐱|⬇️█♥~○○}☉⬇️sw⬅️●ws▒🐱{w♥⌂||}웃█sr⬅️😐▒t|⬅️●█p웃웃~s░○█p{⌂♪yq☉😐▒w|🐱⌂su✽웃○w○●✽yx☉♪wr🐱⬇️✽t|◆웃zu~웃█{○⬇️🐱r}✽⬇️|○○~○z○~⬇️█}{~✽⬇️y웃░}{░✽~⬇️{☉☉wv█░▒▒}z🐱yz웃✽~{█|░}y✽●{z▒█⬇️●y░☉|w}✽⬇️|z○웃ws⬇️😐▒v|✽✽xx✽웃zv~🐱🐱▒{✽░|}⬇️~⬇️█|○▒░wu⌂v|✽⬇️q⬇️★zi☉❎~n…🅾️ksˇ✽m}🅾️}p}⬅️~x★░g}▥}f✽▤~j|…zv⬅️웃r}🅾️yq♪😐yt😐♥kzˇ⬇️h▒ˇ|p~⌂█x▒☉}u✽☉🐱u{⬅️▒u🐱😐zt☉🅾️tr⬅️♥▒b⌂∧\\░▥l█☉⬇️⌂k▒おbuいk}😐{♪o{かhkきxr✽v😐{nけziう{m⌂{웃~iお▒`ˇ웃l⬅️w✽☉g●ˇi😐▒u◆○n⬆️wx∧k~⬆️a★░g▤}lかlyあd⬇️⧗a…웃fいtrくhsおd⌂⬅️a❎♥fおnrさhu▥f…⌂_お🐱`くtlえj█❎`⬆️◆\\あ⬇️cうptおc▒お^🅾️…c❎{jおiwきb⬇️あd➡️●dいtkかhwさd♥★e∧⬇️^かslおlzえe😐…b❎🐱dうtnうk}⬆️e🅾️♪b⬆️⬇️m▤ruいl~…h⬅️⬅️g★▒rˇtx∧l█♪i⌂♥m…~v⬆️tz➡️n🐱☉m웃✽q…|x➡️xz⬅️q⬇️✽p♥⬇️v♪|{◆x|♥s░⬇️o☉░y⌂{~🅾️v{♥t⬇️▒s☉░x⌂|~웃w{♥u⬇️▒w☉⬇️y⌂|~●w~░u⬇️⬇️y♥█|⌂{|●w▒⬇️u░⬇️z☉}|⌂{|●v🐱⬇️v░🐱z웃|{☉{~✽u░⬇️w░▒y⬅️{|♥z○✽s✽🐱x✽█y😐z~♥y█●s✽▒w☉~y⬅️z○☉w▒✽v●○v웃}{☉y█웃v⬇️⬇️w●~w웃{|☉x▒●u✽🐱v♥~y웃y~웃w▒✽u●█x☉~z⌂x█●w▒░u♥○z웃}{☉y▒✽u🐱🐱y●~{⬅️|~●y▒⬇️t⬇️█y♥~}☉|█✽x▒▒x░~{♥~○✽{▒⬇️y🐱○|✽}}✽}▒🐱{⬇️█{⬇️~~⬇️}█⬇️|🐱█}⬇️~}⬇️|█▒{🐱▒}🐱~○✽}██}🐱○{⬇️~○░|█⬇️|⬇️○{░○}░{▒░{▒▒z✽}|░~○✽z🐱🐱z🐱○z✽}}●|█░z▒▒y░~|░~~✽{🐱⬇️z🐱█{░}}✽}○⬇️|🐱🐱|▒█|⬇️}~🐱~○🐱|▒█}▒█~🐱~○▒~○▒~██○▒○○█○○█○○█○█▒○██○○█○○████~██○○○○▒○○█○██~○█○▒○○▒█○▒○○█○○█~██○██○█○○█~○█○██○▒○~▒○○█~█▒~██~▒○○▒○○▒~██~██~█○○▒○█▒○▒█}█○○▒~█▒○██~▒○~▒○○▒○█▒~██~█○○▒~○████~▒█○██○▒~○█○○█○▒█○█○○█~██○█○██○○█○█○○█○██○█○○█○○█○██○██○█○○█○○█~▒█~▒█○▒~○▒~○▒~▒█~▒○~▒~○▒~██~▒○~🐱~○▒}█▒}▒█}🐱○~🐱~○🐱}█▒}▒○~🐱○○🐱~█▒~██}▒○~▒~○▒~█▒~▒█~▒○~▒~○▒~██~▒○○▒○○▒~██~██~█○○▒○○▒○██~██○█○○▒○○█○██~██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○████○██○○○○○○○○█████○█○○○○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○██○█○○█○○█○○█○██○█○○█○○█○○█○██○█○○█○○█○██○██○█○○█○○█○○█○█○○█○○█○○█○█○○█○○█○○█○█○○█○○█○○█○██○█○○█○○○○○○○○○○█○○█○█○○○○○█○○█○█○○█○○○○○█○○█○██○█○○█○○○○○○○○█○█○○█○○█○○█○○○○█○○█○○█○○○○○█○█○○█○○○○○○○█○○○○○█○○█○○○○○○○○○○█○○○○○○○█○○○○○█○○○○○○○○○○█○○█○○○○○○○○○○○○○█○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○█○○█○○○○██○○○○○○○○○○○○█○○○○○○○○○○○○○○○○█○○○○█○○█○○█○○○○█○○█○○○○○█○○█○█○○○○○○○○○○○█○█○○○○○█○○█○○○○○○○○○○█○█○○○○○○○○○○○○█○█○○○○○█○○█○○█○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○█○○█○○○○○○○█○○█○○█○○○○█○○○○○○○○█○○○○○○○○○○○○○○○○○○○○█○○○○█○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○██○○○○○○○█○○○○○█○○○○○○○█○○○○○○○○█○○█○○○○○○○○○○○○○█○○█○█○○█○○○○○█○○○○█○○○○○█○○○○○○○○○○○○○○○○█○○○○○█○○○○○○○○○○█○○○○○○█○○█○██○○█○█○○█○██○█○○○○○○○○○○○○○█○○○○○○○○○○○○○○○○○○○○○○○○○█○○○○○███○○○○○█○○○○○○○○○█○○○○○○○○○██○○○○○○○○○○○○█○○██○○○○○○█○○○█○█○○█○○○○○█○█○○○○○○○○○█○○○○○○○○○○○○○○○○█○○█○○█○○█○○○○○○○█○○○○○○○█○○█○○○○○○○○█○██○○○█○██○○█○█○○○○○█○██○██○██○█○○█○○○○█○○○○○█○○█○○█○○○█○○██○○█○○○○██████████████████○○██○○█○█○█○○█○○○○○○○○█○○○○○○○██○○○○████○█○"
	
end
_update=function()
	--defy_player:play_from_serial()
	defy_player:play()
	if btnp(4) or btnp(5) then
		printh(defy_player.clip,"@clip")
		print("copied")
	end
end


